depot/app/controllers/admin_controller.rb

SELECT count(*) AS count_all FROM "orders"
---
  def index
    @total_orders = Order.count