depot/app/controllers/orders_controller.rb

SELECT * FROM "orders" WHERE ("orders"."id" = 953125641)
---
  def show
    @order = Order.find(params[:id])

SELECT * FROM "orders" WHERE ("orders"."id" = 953125641)
---
  def edit
    @order = Order.find(params[:id])

SELECT * FROM "orders" WHERE ("orders"."id" = 953125641)
---
  def update
    @order = Order.find(params[:id])

SELECT * FROM "orders" WHERE ("orders"."id" = 953125641)
DELETE FROM "orders" WHERE "id" = 953125641
---
  def destroy
    @order = Order.find(params[:id])
    @order.destroy