depot/app/controllers/store_controller.rb

SELECT * FROM "products" ORDER BY title
---
  def index
    @cart = find_cart
    @products = Product.find_products_for_sale

SELECT * FROM "products" WHERE ("products"."id" = 953125641)
---
  def add_to_cart
    product = Product.find(params[:id])

INSERT INTO "line_items" ("order_id", "updated_at", "total_price", "product_id", "quantity", "created_at") VALUES(996332878, '2009-02-23 06:46:21', 1234.0, 1027351790, 1, '2009-02-23 06:46:21')
INSERT INTO "orders" ("name", "updated_at", "pay_type", "address", "email", "created_at") VALUES('Dave Thomas', '2009-02-23 06:46:21', 'check', '123 The Street', 'dave@pragprog.com', '2009-02-23 06:46:21')
---
  def save_order
    @cart = find_cart
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save