depot/app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 953125641) LIMIT 1
---
  def index
    @users = User.find(:all, :order => :name)

SELECT * FROM "users" WHERE ("users"."id" = 953125641) LIMIT 1
---
  def show
    @user = User.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" = 953125641) LIMIT 1
---
  def edit
    @user = User.find(params[:id])

INSERT INTO "users" ("name", "salt", "updated_at", "hashed_password", "created_at") VALUES('aksdljfhalksdjfh', '186931900.819457443445121', '2009-02-16 06:56:34', '811f0e46223544b352576c02476a5fd3028d0b77', '2009-02-16 06:56:34')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 953125641) LIMIT 1
---
  def update
    @user = User.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" = 953125641) LIMIT 1
DELETE FROM "users" WHERE "id" = 953125641
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy