rubyholic/rubyholic/app/controllers/events_controller.rb

  def index
    @events = Event.paginate :page => params[:page], :per_page => 10
---
SELECT * FROM "events" LIMIT 10 OFFSET 0

  def show
    @event = Event.find(params[:id])
---
SELECT * FROM "events" WHERE ("events"."id" = 953125641)

  def edit
    @event = Event.find(params[:id])
---
SELECT * FROM "events" WHERE ("events"."id" = 953125641)

  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("name", "updated_at", "end", "description", "start", "created_at") VALUES(NULL, '2009-02-28 23:11:49', NULL, NULL, NULL, '2009-02-28 23:11:49')

  def update
    @event = Event.find(params[:id])
---
SELECT * FROM "events" WHERE ("events"."id" = 953125641)

  def destroy
    @event = Event.find(params[:id])
    @event.destroy
---
SELECT * FROM "events" WHERE ("events"."id" = 953125641)
DELETE FROM "events" WHERE "id" = 953125641