rubyholic/rubyholic/app/controllers/locations_controller.rb

SELECT * FROM "locations" ORDER BY upper(name) ASC LIMIT 10 OFFSET 0
---
  def index
    if params[:order_by]
      @locations = Location.paginate :page => params[:page], :per_page => 10, :order => 'upper(name) ASC'

SELECT * FROM "locations" WHERE ("locations"."id" = 953125641)
---
  def show
    @location = Location.find(params[:id])

SELECT * FROM "locations" WHERE ("locations"."id" = 953125641)
---
  def edit
    @location = Location.find(params[:id])

INSERT INTO "locations" ("name", "latitude", "updated_at", "longitude", "created_at") VALUES('Coffee_Shop', 45.19, '2009-02-19 03:52:59', -116.15, '2009-02-19 03:52:59')
---
  def create
    @location = Location.new(params[:location])

    respond_to do |format|
      if @location.save

SELECT * FROM "locations" WHERE ("locations"."id" = 953125641)
---
  def update
    @location = Location.find(params[:id])

SELECT * FROM "locations" WHERE ("locations"."id" = 953125641)
DELETE FROM "locations" WHERE "id" = 953125641
---
  def destroy
    @location = Location.find(params[:id])
    @location.destroy